app/controllers/artists_controller.rb

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
SELECT "artists".* FROM "artists"  ORDER BY name ASC
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" DESC
---
  def index
    artist_order = Preference.first_or_create.artist_sort_order
    @artists = Artist.all.order("name #{artist_order}")

SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
---
  def new
    artist_access = Preference.first_or_create.allow_create_artists